In [ ]:
====== EDA======
1) pandas : date frame application
2) numpy : numerical python all math appilcation 
3) matplotlib : used for plotting
4) seabron : use for plot
5) bokhe : polt
6) ploaty : use for plot

====== machine learing ==========
7) sickit-leran : sklearn

====== deep learing =========
8) tensoflow : google
9) keras : google
10) pytorch : facebook

====== NLP ==========
11) NLTK : natural langague tool kit
12) scipy

====== BERT ========
13) transformers : hugging face (google)

====== google models ======

14) specific google packages

====== azure =====

15) azure packages

====== GENAI =====

16) gemiani : google
17) chatgpt : openai

======= langchain ======

18) langchain packages

In [ ]:
- list === dictionary
- dictionary === llist

$stpe1$

**create a dataframe using list

In [14]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [15]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [17]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [18]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  25      hyd
1  Avinash  30      blr
2    Akash  35  chennai

In [19]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

**provide the column name**

In [20]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['names','age'])

     names  age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [21]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['names','age','city']
df=pd.DataFrame(data,columns=cols)

In [22]:
df

     names  age     city
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

$step-4$

**ADD new column**

-  If you want to add new column
-  First you need to check the number of rows in already existed data
-  For example in above the dataframe has 3 rows
-  You need to create a new list with 3 rows
-  that list equate to the dataframe

In [23]:
job=['DS','DE','CS']
df['job']=job
df

     names  age     city job
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [31]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['names','age','city']
df=pd.DataFrame(data,columns=cols)
df

     names  age     city
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [32]:
job=['DS','DE','CS']
df['job']=job
df

     names  age     city job
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [33]:
df['age']=[35,40,45]
df

     names  age     city job
0    Ayush   35      hyd  DS
1  Avinash   40      blr  DE
2    Akash   45  chennai  CS

In [37]:

import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['names','age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     names  age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [40]:
df.shape
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

In [41]:
df

     names  age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [43]:
df.drop('city',
        axis=1,
        inplace=True)
df

     names  age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [44]:
df1=df.drop('age',axis=1)

In [45]:
df

     names  age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [46]:
df1

     names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [47]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [49]:
df.drop('City',axis=1,inplace=True)

In [50]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [51]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [52]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [3]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [54]:
df.drop(['Age','City'],axis=1,inplace=True)

In [4]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [5]:
df.to_csv('data.csv')